femat7/tutorials/combustion/fireFoam/LES/oppositeBurningPanels/constant/panelRegion/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiation       on;

radiationModel  opaqueSolid;

absorptionEmissionModel greyMeanSolid;

greyMeanSolidCoeffs
{
    wood
    {
        absorptivity    0.17;
        emissivity      0.17;
    }

    char
    {
        absorptivity    0.85;
        emissivity      0.85;
    }
}

scatterModel    none;


// ************************************************************************* //
